dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
  /* Infinite loop */
//  LED1_OFF;
//  LED2_ON;
  for (;;)
  {
//    LED1_TOGGLE;
//    LED2_TOGGLE;
    SystickDelay(100);
  }
}
#endif


/**
  * @brief  Add a delay using the Systick
  * @param  nTime Delay in milliseconds.
  * @retval None
  */
void SystickDelay(__IO uint32_t nTime)
{

  Gv_SystickCounter = nTime;
  while (Gv_SystickCounter != 0)
  {
    // The Gv_SystickCounter variable is decremented every ms by the Systick interrupt routine
  }

}

void TimingDelay_Decrement(void)
{
	if (Gv_SystickCounter != 0x00)
	{
		Gv_SystickCounter--;
	}
	//TSL_tim_ProcessIT();

	if(++led_counter>6){
		led_counter = 0;
		digit_num++;
		flash_counter++;
		if(digit_num>2) digit_num = 0;
		GPIOA->BSRR = GPIO_BSRR_BR_0  | GPIO_BSRR_BR_2; // Turn off the lights while changing them
		GPIOC->BSRR = GPIO_BSRR_BR_3;
		show_digit(((display_data & 0xFFF)& (0x0F<<(digit_num*4)))>>(digit_num*4));
		if(flash_mode < 3 ||(flash_counter & 0x40)){
			switch (digit_num){
			case 2:
				GPIOA->BSRR = GPIO_BSRR_BS_2 ;
				GPIOA->BSRR = GPIO_BSRR_BR_0 ;
				GPIOC->BSRR = GPIO_BSRR_BR_3;
				break;

			case 1:
				GPIOC->BSRR = GPIO_BSRR_BS_3 ;
				GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_2;
				break;
			case 0:
			default:
				GPIOA->BSRR = GPIO_BSRR_BS_0 ;
				GPIOA->BSRR = GPIO_BSRR_BR_2;
				GPIOC->BSRR = GPIO_BSRR_BR_3;
				break;
			}
		}
		if (((flash_mode == 1)&& digit_num == 0 && (flash_counter & 0x40)) || ((flash_mode == 2) && (digit_num == 2))){
			GPIOC->BSRR = GPIO_BSRR_BS_0 | GPIO_BSRR_BS_1;
		}
		else
		{
			GPIOC->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_1;
		}
	}
	if(start_delay)start_delay--;
	if(Gv_miliseconds++>60000L){
		Gv_miliseconds = 0;
		if (pre_time)
		{
			pre_time--;
			if (pre_time == 0 && main_time != 0)
			{
				start_delay = 2000L;
			}
		}
		else if (main_time) {
			main_time--;
			minute_counter ++;
			if(main_time == 0){
				//play_message(2);
			}
		}
		else if (cool_time) cool_time--;
		//update_status();
	}
	if  (Gv_UART_Timeout){
		Gv_UART_Timeout--;
		if(! Gv_UART_Timeout) {
			rx_state = 0;
			pre_time_sent = 0, main_time_sent = 0, cool_time_sent = 0;
		}
	}
	update_status();
}


void KeyPressed_0(void){//START Key(Left)

//	push_note(E2,2);
//	push_note(G2,2);
//	push_note(C3,2);
	if( curr_status == STATUS_WAITING ){
		clear_notes();

		push_note(C3,6);
		push_note(E3,4);
		Gv_miliseconds = 0;
		pre_time = 0;
		start_delay = 2000L;
		//send_start();
	}
	if((curr_status == STATUS_FREE || curr_status == STATUS_ERROR) ) {
		clear_notes();

		push_note(C3,6);
		{
			if (state > state_enter_service){
				// Write EEPROM
				if(state == state_clear_hours){
					work_hours[0] = 0;
					work_hours[1] = 0;
					work_hours[2] = 0;
				}
				write_eeprom();
				read_eeprom();
				start_counter = 0;
				flash_mode = 0;
				state = state_set_time;
			} else {
				start_counter = START_COUNTER_TIME;
				state = state_show_hours;
			}
		}
	}
}

void KeyPressed_2(void){ // +
	if(state == state_show_hours) {
		state = state_set_time;
		start_counter = 0;
	}
	if(state == state_set_time ){
		if(main_time < 25){
			pre_time = preset_pre_time;
			cool_time = preset_cool_time;
			main_time ++;
//			if((time_to_set & 0x0F)>9) time_to_set +=6;
		}
	}
	else if(state == state_show_time && curr_status == STATUS_WAITING)
	{
		if(main_time < 25)
		{
			main_time ++;
		}
	}
	else if(state > state_enter_service){
		start_counter = EXIT_SERVICE_TIME;
		switch (service_mode){
		case mode_set_address:
			if(controller_address<15) controller_address++;
			break;
		case mode_set_pre_time:
			if(preset_pre_time<9) preset_pre_time++;
			break;
		case mode_set_cool_time:
			if(preset_cool_time<9) preset_cool_time++;
			break;
		default:
			break;
		}
	}
	clear_notes();

	push_note(A3,8);
}
void KeyPressed_1(void){ // -
//	if(state == state_show_hours) {
//		state = state_set_time;
//		start_counter = 0;
//	}
	if(state == state_show_time && curr_status == STATUS_WAITING )
	{
		if(main_time) {
			main_time--;
		}
		if (main_time == 0)
		{
			pre_time = 0;
			cool_time = 0;
		}
	}else if(state > state_enter_service){
		start_counter = EXIT_SERVICE_TIME;
		switch (service_mode){
		case mode_set_address:
			if(controller_address) controller_address--;
			break;
		case mode_set_pre_time:
			if(preset_pre_time) preset_pre_time--;
			break;
		case mode_set_cool_time:
			if(preset_cool_time) preset_cool_time--;
			break;
		default:
			break;
		}
	}

//	if((time_to_set & 0x0F)>9) time_to_set -=6;
	clear_notes();

	push_note(A3,8);

}

//void ping_status(void){
//
//	static int ping_index = 0;
//	volatile static int status_codes[4];
//	// Ping solarium for status
//	if(!(flash_counter&0x0f)){
//		int sts;
//		ping_counter ++;
//		ping_index = (ping_index + 1) & 0x03;
//		status_codes[ping_index] = get_controller_status(controller_address);
//		if(status_codes[ping_index]==status_codes[0] && status_codes[ping_index]==status_codes[1] &&
//				status_codes[ping_index]==status_codes[2] && status_codes[ping_index]==status_codes[3] ){
//			sts = status_codes[ping_index];
//		}
//		else {
//			return;
//		}
//
//		if(sts != -1){
//			curr_status = (sts & 0xC0)>>6;
//			curr_time = sts & 0x3F;
//		} else {
//			curr_status = -1;
//			curr_time = 0;
//		}
//
//		curr_time = FromBCD(curr_time);
//	}
//}
//
//void send_time(void){
//	// Ping solarium for status
//	if(controller_address >15){
//		curr_status = -1;
//		curr_time = 0;
//	} else {
//		int retry = 0;
//		int retry2 =0;
//		char data;
//		int time_in_hex = ToBCD(time_to_set);
//		preset_pre_time = preset_pre_time & 0x7F;
//		// checksum: CoolTime + Pre-Time - 5 - MainTime
//
//		while(retry < 20){
//			// clear in FIFO
//			volatile unsigned char checksum = (preset_pre_time + preset_cool_time  - time_in_hex - 5) & 0x7F;
//			volatile unsigned char  remote_check_sum = 220;
//			while(USART_GetFlagStatus(USART1,USART_FLAG_RXNE))	USART_ReceiveData(USART1); // Flush input
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//
//			USART_SendData(USART1,0x80U | ((controller_address & 0x0fU)<<3U) | 2U); //Command 2 == Pre_time_set
//			SystickDelay(2);
//			USART_SendData(USART1,preset_pre_time);
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//
//
//			SystickDelay(2);
//			USART_SendData(USART1,0x80U | ((controller_address & 0x0fU)<<3U) | 5U); //Command 5 == Main time set
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//
//			SystickDelay(2);
//			USART_SendData(USART1,time_in_hex);
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//
////			SystickDelay(2);
//			retry2 =0;
//			while(!USART_GetFlagStatus(USART1,USART_FLAG_RXNE) && retry2++<10){
//				SystickDelay(2);
//			}
//			USART_ReceiveData(USART1); //"Read" old time
//
//			SystickDelay(2);
//			USART_SendData(USART1,0x80U | ((controller_address & 0x0fU)<<3U) | 3U); //Command 3 == Cool Time set
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//
//			SystickDelay(2);
//			USART_SendData(USART1,preset_cool_time);
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//
//
//			SystickDelay(4);
//			retry2 =0;
//			while(!USART_GetFlagStatus(USART1,USART_FLAG_RXNE) && retry2++<10){
//				SystickDelay(2);
//			}
//			if(USART_GetFlagStatus(USART1,USART_FLAG_RXNE)){
//				remote_check_sum = USART_ReceiveData(USART1); //"Read" checksum
//			}
//			SystickDelay(20);
////			checksum = remote_check_sum;
//			if(remote_check_sum == checksum){
//				SystickDelay(2);
//				USART_SendData(USART1,checksum);
//				while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//
//			}
//			SystickDelay(100);
//			USART_SendData(USART1,0x80U | ((controller_address & 0x0f)<<3U) | 0); //Command 0 - Get status
//			SystickDelay(20);
//			data = USART_ReceiveData(USART1); //"Read" status
//			if ((data >> 6 ) != 0 ) retry = 22;
//			retry ++;
//		}
//
//		/**************** OLD Pascal code as example
//		CheckSum:=PreTime+CoolTime-DataSent-5;
//		    CheckSum:=CheckSum mod 128 ;
//		    PurgeComm(hDevice,(PURGE_TXCLEAR or PURGE_RXCLEAR	));
//		    while retry<20 do
//		     begin
//		      for i:=1 to 10 do IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);
//		      Data1:=128+Chanel*8+2;
//		      IOResult:=WriteFile(hDevice,Data1,1,IOCount,NIL);
//		      sleep(2);             // Set PRE-Time
//		      IOResult:=WriteFile(hDevice,PreTime,1,IOCount,NIL);
//		      Data1:=128+Chanel*8+5;
//		      sleep(2);              // Set main time
//		      IOResult:=WriteFile(hDevice,Data1,1,IOCount,NIL);
//		      sleep(2);
//		      IOResult:=WriteFile(hDevice,DataSent,1,IOCount,NIL);
//		      sleep(2);
//		      IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);   // get old main time
//		      Data1:=128+Chanel*8+3; //  Set cool time
//		      IOResult:=WriteFile(hDevice,Data1,1,IOCount,NIL);
//		      sleep(2);
//		      IOResult:=WriteFile(hDevice,CoolTime,1,IOCount,NIL);
//		      sleep(4);
//		      IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL); // Get checksum?
//		      if IOResult and (IOByte=CheckSum) then
//		      IOResult:=WriteFile(hDevice,CheckSum,1,IOCount,NIL);
//		      sleep(100);
//		      Data1:=128+Chanel*8; // Get status command for selected chanel
//		      IOResult:=WriteFile(hDevice,Data1,1,IOCount,NIL);
//		      sleep(5);
//		      IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);
//		      IOByte:= IOByte div 64;
//		      if IOResult and (IOByte <>0) and
//		        ((DataSent=0) or (PreTime > 0) or ((IOByte = 1) and (DataSent >0)))    then
//		        begin
//		          retry:=22;
//		        end
//		      else retry:= retry+1;
//		      sleep(1);
//		      MainForm.Gauge2.Progress:=retry;
//		     end;
//		     IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);
//		     IOResult:=ReadFile(hDevice,IOByte,1,IOCount,NIL);
//
//		*/
//	}
//}

void update_status(void){
	if(pre_time) {
		curr_status = STATUS_WAITING;
		set_relay1(0);
		set_relay2(0);
	}
	else if(main_time) {
		curr_status = STATUS_WORKING;
		set_relay1(1);
		set_relay2(1);
	}
	else if(cool_time) {
		curr_status = STATUS_COOLING;
		set_relay1(0);
		set_relay2(1);
	}
	else {
		curr_status = STATUS_FREE;
		set_relay1(0);
		set_relay2(0);
	}
}

//void send_start(void){
//	// Ping solarium for status
//	if(controller_address >15){
//		curr_status = -1;
//		curr_time = 0;
//	} else {
//			while(USART_GetFlagStatus(USART1,USART_FLAG_RXNE))	USART_ReceiveData(USART1); // Flush input
//			while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
//
//			USART_SendData(USART1,0x80 | ((controller_address & 0x0f)<<3) | 1); //Command 1 == start
//			SystickDelay(2);
//			USART_SendData(USART1,0x55);
//	}
//}

void read_eeprom(void){
	int index = 0;
	flash_struct *flash_mem;
	uint32_t *p = (uint32_t *)eeprom_array;
	for(index = 0; index<512; index+=2){
		if(*(p + index)==0xFFFFFFFF) break;
	}
	if(index == 0){
		// Load defaults
		flash_mem = 0;
		preset_pre_time = 7;
		preset_cool_time = 3;
		controller_address = 16;
		work_hours[0] = 0;
		work_hours[1] = 0;
		work_hours[2] = 0;
		write_eeprom();
		return;
	}
	index-=2;
	flash_mem = (flash_struct*)&eeprom_array[index];
	preset_pre_time = flash_mem->settings.pre_time ;
	preset_cool_time = flash_mem->settings.cool_time;
	controller_address = flash_mem->settings.addresse & 0x0f;
	work_hours[0] = flash_mem->time.hours_h;
	work_hours[1] = flash_mem->time.hours_l;
	work_hours[2] = flash_mem->time.minutes;
}

void write_eeprom(void){
	volatile int index = 0;
	FLASH_Unlock();
	volatile flash_struct flash_mem;
	uint32_t *p = (uint32_t *)eeprom_array;
//	uint32_t *p = (uint32_t *)&flash_mem;
	for(index = 0; index<512; index+=2){
		if(*(p + index)==0xFFFFFFFF) break;
	}

//	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<(512)))index+=2;
	if(index > 511){
		// No more room. Erase the 4 pages
		FLASH_ErasePage((uint32_t)&eeprom_array[0]);
		FLASH_ErasePage((uint32_t)&eeprom_array[128]);
		FLASH_ErasePage((uint32_t)&eeprom_array[256]);
		FLASH_ErasePage((uint32_t)&eeprom_array[384]);
		index = 0;
	}
	for(index = 0; index<512; index+=2){
		if(*(p + index)==0xFFFFFFFF) break;
	}
	if(index >511){
		display_data = 0xE01;
		for (index = 0; index<20; index++){
			clear_notes();

